#include <stdio.h>

// 数组
int main() {

    // 定义数组
    int a[10];

    // 数组中的内存地址是连续的，假设第一个元素的内存地址为 0x0000 第二个元素的内存地址就是0x0004 ...
    for (int i = 0; i < 10; i++) {   
        if (i < 3)
            a[i] = i; 
        // 数组中没有被赋值的元素默认为0
        printf("a[%d] = %d ", i, a[i]);
    }

    // 定义时直接赋值
    int a1[5] = {0, 1, 2, 3, 4};

    // 二位数组
    int b[3][4] = {
        {0, 1, 2, 3}, 
        {1, 2, 4, 8}, 
        {1, 3, 9, 27}
    };

    for (int i = 0; i < 3; i++) {
        printf("\n");
        for (int j = 0; j < 4; j++) {
            printf("\t %d ", b[i][j]);
        }
    }
    
    
}